#+BEGIN_EXPORT html
---
layout: page
title: Prism Introduction
tagline: ""
permalink: /python/dev-env/prism-intro.html
categories: [Python, Dev-Env, Prism]
tags: []
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+PROPERTY: header-args+ :session prism
#+PROPERTY: vizier-thread-id thread_ZEKKlxsq9EQpTFuZiYCPAuSS
#+PROPERTY: vizier-assistant-id asst_9U8N72u9uVQesQNNjgOLJOu8
#+TOC: headlines 3
** Install Node.js and npm

`Prism` is a Node.js-based application, so you need to ensure that
Node.js and npm (Node Package Manager) are installed on your
system. You can install them using the following commands:


#+begin_src sh
sudo apt update
sudo apt install nodejs npm
#+end_src

You can verify the installations by checking the versions:


#+begin_src sh
node -v
npm -v
#+end_src

#+RESULTS:
: v18.19.0
: 9.2.0

** Verify Installation

After installing, you can verify that `Prism` is correctly installed
by checking its version:

#+begin_src sh
prism --version
#+end_src

#+RESULTS:
: 5.9.0

